# Add or Remove rows and columns from DataFrame

In [1]:
import pandas as pd

In [2]:
people = {'name' : ['abhi','azure', 'mark', 'elon'],
         'surname': ['joshi','interior', 'tolan', 'musk'],
         'Hobby':['play','sing','dance','watch']}

In [3]:
df = pd.DataFrame(people)

In [4]:
df

    name   surname  Hobby
0   abhi     joshi   play
1  azure  interior   sing
2   mark     tolan  dance
3   elon      musk  watch

### Suppose we want to add new column named as 'full_name'

In [5]:
df['full_name'] = df['name'] + '_' + df['surname']

In [6]:
df

    name   surname  Hobby       full_name
0   abhi     joshi   play      abhi_joshi
1  azure  interior   sing  azure_interior
2   mark     tolan  dance      mark_tolan
3   elon      musk  watch       elon_musk

### Removing Column

In [7]:
df.drop(columns=['name','surname']) # to make changes inplace use inplace=True

   Hobby       full_name
0   play      abhi_joshi
1   sing  azure_interior
2  dance      mark_tolan
3  watch       elon_musk

In [8]:
df

    name   surname  Hobby       full_name
0   abhi     joshi   play      abhi_joshi
1  azure  interior   sing  azure_interior
2   mark     tolan  dance      mark_tolan
3   elon      musk  watch       elon_musk

In [9]:
df.drop(columns=['name','surname'], inplace=True)

In [10]:
df

   Hobby       full_name
0   play      abhi_joshi
1   sing  azure_interior
2  dance      mark_tolan
3  watch       elon_musk

### Example: To recreate first name and last name from full_name

In [12]:
df['full_name'].str.split('_')

0        [abhi, joshi]
1    [azure, interior]
2        [mark, tolan]
3         [elon, musk]
Name: full_name, dtype: object

#### To convert list value above to columns, use expand = True

In [13]:
df['full_name'].str.split('_', expand=True)

       0         1
0   abhi     joshi
1  azure  interior
2   mark     tolan
3   elon      musk

#### Setting these columns as a new columns

In [14]:
df[['first_name','last_name']] = df['full_name'].str.split('_', expand=True)

In [15]:
df

   Hobby       full_name first_name last_name
0   play      abhi_joshi       abhi     joshi
1   sing  azure_interior      azure  interior
2  dance      mark_tolan       mark     tolan
3  watch       elon_musk       elon      musk